### LOAD SQL EXTENSION

In [47]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### CREATING A DATABASE NAMED ANIMALS TO STORE RECORDS

In [ ]:
%sql sqlite:///Animals.db

### CREATING TABLES ANIMALS, HABITATS, DIET, MEDICALRECORDS

In [49]:

%%sql
-- Create tables in SQLite

CREATE TABLE IF NOT EXISTS Habitats (
    habitat_id INTEGER PRIMARY KEY AUTOINCREMENT,
    habitat_name TEXT,
    climate TEXT
);

CREATE TABLE IF NOT EXISTS Diet (
    diet_id INTEGER PRIMARY KEY AUTOINCREMENT,
    diet_type TEXT,
    description TEXT
);

CREATE TABLE IF NOT EXISTS Animals (
    animal_id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    species TEXT,
    breed TEXT,
    age INTEGER,
    gender TEXT,
    weight REAL,
    habitat_id INTEGER,
    diet_id INTEGER,
    FOREIGN KEY (habitat_id) REFERENCES Habitats(habitat_id),
    FOREIGN KEY (diet_id) REFERENCES Diet(diet_id)
);

CREATE TABLE IF NOT EXISTS MedicalRecords (
    record_id INTEGER PRIMARY KEY AUTOINCREMENT,
    animal_id INTEGER,
    last_checkup_date TEXT,
    diseases TEXT,
    vaccination_status TEXT,
    FOREIGN KEY (animal_id) REFERENCES Animals(animal_id)
);

 * sqlite:///Animals.db
Done.
Done.
Done.
Done.

[]

### INSERT INTO THE ABOVE MADE TABLES ANIMALS, HABITATS, DIET, MEDICALTABLES

In [50]:
%%sql
-- Insert data into Habitats
INSERT INTO Habitats (habitat_name, climate) VALUES 
('Savannah', 'Tropical'), 
('Rainforest', 'Tropical'), 
('Desert', 'Arid');

-- Insert data into Diet
INSERT INTO Diet (diet_type, description) VALUES 
('Carnivorous', 'Eats meat'),
('Herbivorous', 'Eats plants'),
('Omnivorous', 'Eats both plants and meat');

-- Insert data into Animals
INSERT INTO Animals (name, species, breed, age, gender, weight, habitat_id, diet_id) VALUES
('Leo', 'Lion', 'African Lion', 5, 'M', 190.5, 1, 1),
('Ella', 'Elephant', 'Asian Elephant', 10, 'F', 5000, 2, 2),
('Max', 'Monkey', 'Capuchin', 3, 'M', 12.3, 2, 3);

-- Insert data into MedicalRecords
INSERT INTO MedicalRecords (animal_id, last_checkup_date, diseases, vaccination_status) VALUES
(1, '2025-06-15', 'None', 'Completed'),
(2, '2025-05-20', 'Flu', 'Pending'),
(3, '2025-07-01', 'None', 'Completed');

 * sqlite:///Animals.db
3 rows affected.
3 rows affected.
3 rows affected.
3 rows affected.

[]

### DISPLAYING ALL TABLES

In [ ]:
import prettytable
prettytable.__dict__["DEFAULT"] = prettytable.SINGLE_BORDER

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%%sql
SELECT * FROM Animals;

 * sqlite:///Animals.db
Done.

[(1, 'Leo', 'Lion', 'African Lion', 5, 'M', 190.5, 1, 1),
 (2, 'Ella', 'Elephant', 'Asian Elephant', 10, 'F', 5000.0, 2, 2),
 (3, 'Max', 'Monkey', 'Capuchin', 3, 'M', 12.3, 2, 3),
 (4, 'Leo', 'Lion', 'African Lion', 5, 'M', 190.5, 1, 1),
 (5, 'Ella', 'Elephant', 'Asian Elephant', 10, 'F', 5000.0, 2, 2),
 (6, 'Max', 'Monkey', 'Capuchin', 3, 'M', 12.3, 2, 3),
 (7, 'Leo', 'Lion', 'African Lion', 5, 'M', 190.5, 1, 1),
 (8, 'Ella', 'Elephant', 'Asian Elephant', 10, 'F', 5000.0, 2, 2),
 (9, 'Max', 'Monkey', 'Capuchin', 3, 'M', 12.3, 2, 3),
 (10, 'Leo', 'Lion', 'African Lion', 5, 'M', 190.5, 1, 1),
 (11, 'Ella', 'Elephant', 'Asian Elephant', 10, 'F', 5000.0, 2, 2),
 (12, 'Max', 'Monkey', 'Capuchin', 3, 'M', 12.3, 2, 3)]

In [61]:
%%sql
-- Animals with Carnivore diet in Tropical habitat
SELECT a.name, a.species, d.diet_type, h.habitat_name
FROM Animals a
JOIN Diet d ON a.diet_id = d.diet_id
JOIN Habitats h ON a.habitat_id = h.habitat_id
WHERE d.diet_type='Carnivore' AND h.climate='Tropical';

-- Animals needing vaccination
SELECT a.name, m.vaccination_status 
FROM Animals a
JOIN MedicalRecords m ON a.animal_id = m.animal_id
WHERE m.vaccination_status='Pending';

-- Average age per species
SELECT species, AVG(age) AS avg_age
FROM Animals
GROUP BY species;

 * sqlite:///Animals.db
Done.
Done.
Done.

[('Elephant', 10.0), ('Lion', 5.0), ('Monkey', 3.0)]

In [62]:
%%sql
-- Count animals per habitat
SELECT h.habitat_name, COUNT(a.animal_id) AS total_animals
FROM Animals a
JOIN Habitats h ON a.habitat_id = h.habitat_id
GROUP BY h.habitat_name;

-- Count animals per diet
SELECT d.diet_type, COUNT(a.animal_id) AS total_animals
FROM Animals a
JOIN Diet d ON a.diet_id = d.diet_id
GROUP BY d.diet_type;

-- Percentage of vaccinated animals
SELECT 
    (SUM(CASE WHEN vaccination_status='Completed' THEN 1 ELSE 0 END)/COUNT(*))*100 AS vaccinated_percentage
FROM MedicalRecords;

 * sqlite:///Animals.db
Done.
Done.
Done.

[(0,)]